## Module: network
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`  


```terraform
Plan: 1 to add, 1 to change, 0 to destroy
```

<details>
  <summary>Show Plan</summary>

  ```terraform
  aws_vpc.main: Refreshing state... [id=vpc-0d895a01b47ccfb04]
aws_eip.lambda: Refreshing state... [id=eipalloc-06155a058c941b5dd]
aws_default_route_table.default: Refreshing state... [id=rtb-0228b7d35bdfba348]
aws_default_network_acl.default: Refreshing state... [id=acl-0a293e49ea86cc7ce]
aws_internet_gateway.gw: Refreshing state... [id=igw-08031402dc515616c]
aws_default_security_group.default: Refreshing state... [id=sg-07bbdcb4fc6d20a75]
aws_subnet.private: Refreshing state... [id=subnet-07f256fc1e9b65732]
aws_subnet.public: Refreshing state... [id=subnet-066a4cc52f615255c]
aws_security_group.lambda: Refreshing state... [id=sg-090d16d17a0b6c2b1]
aws_route_table.public: Refreshing state... [id=rtb-0c40a8fd1f51baec7]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-09d9428ba0886977f]
aws_security_group_rule.inet_egress: Refreshing state... [id=sgrule-1598225514]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05cc02536d86ce34d]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-09e7050aa7d123674]
aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-03329e92062edf232]
aws_route_table.private: Refreshing state... [id=rtb-08c76912dc727184b]
aws_route_table_association.a: Refreshing state... [id=rtbassoc-0043ca13d1dec5810]
aws_security_group_rule.dynamodb_privatelink: Refreshing state... [id=sgrule-2068073685]
aws_security_group_rule.s3_private_link: Refreshing state... [id=sgrule-2802359572]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_default_network_acl.default will be updated in-place
  ~ resource "aws_default_network_acl" "default" {
        id                     = "acl-0a293e49ea86cc7ce"
      ~ subnet_ids             = [
          - "subnet-066a4cc52f615255c",
          - "subnet-07f256fc1e9b65732",
        ]
        tags                   = {
            "Name" = "metricsstaging_default_nacl"
        }
        # (5 unchanged attributes hidden)

      - egress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - icmp_code  = 0 -> null
          - icmp_type  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 102 -> null
          - to_port    = 0 -> null
        }

      - ingress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 1024 -> null
          - icmp_code  = 0 -> null
          - icmp_type  = 0 -> null
          - protocol   = "6" -> null
          - rule_no    = 101 -> null
          - to_port    = 65535 -> null
        }
      - ingress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 443 -> null
          - icmp_code  = 0 -> null
          - icmp_type  = 0 -> null
          - protocol   = "6" -> null
          - rule_no    = 100 -> null
          - to_port    = 443 -> null
        }
    }

  # aws_network_acl.main will be created
  + resource "aws_network_acl" "main" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "-1"
              + rule_no         = 102
              + to_port         = 0
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "tcp"
              + rule_no         = 101
              + to_port         = 65535
            },
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 443
              + icmp_code       = null
              + icmp_type       = null
              + ipv6_cidr_block = ""
              + protocol        = "tcp"
              + rule_no         = 100
              + to_port         = 443
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = [
          + "subnet-066a4cc52f615255c",
          + "subnet-07f256fc1e9b65732",
        ]
      + tags       = {
          + "Name" = "metricsstaging_main_nacl"
        }
      + tags_all   = {
          + "Name" = "metricsstaging_main_nacl"
        }
      + vpc_id     = "vpc-0d895a01b47ccfb04"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/covid-alert-metrics-terraform/covid-alert-metrics-terraform/tfplan.binary"
  ```
</details>